app/controllers/addresses_controller.rb

SELECT * FROM "addresses"
---
  def index
    @addresses = Address.all

SELECT * FROM "addresses" WHERE ("addresses"."id" = 980190962)
---
  def show
    @address = Address.find(params[:id])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 980190962)
---
  def edit
    @address = Address.find(params[:id])

INSERT INTO "addresses" ("city", "zip", "created_at", "country", "street1", "updated_at", "street2") VALUES(NULL, NULL, '2010-03-09 23:37:36', NULL, NULL, '2010-03-09 23:37:36', NULL)
---
  def create
    @address = Address.new(params[:address])

    respond_to do |format|
      if @address.save

SELECT * FROM "addresses" WHERE ("addresses"."id" = 980190962)
---
  def update
    @address = Address.find(params[:id])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 980190962)
DELETE FROM "addresses" WHERE "id" = 980190962
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy