app/controllers/orders_controller.rb

INSERT INTO "orders" ("created_at", "card_type", "updated_at", "amount", "last_name", "card_expires_on", "first_name", "ip_address") VALUES('2010-03-01 23:34:36', 'visa', '2010-03-01 23:34:36', 5.0, 'blow', '2010-03-01', 'joe', '127.0.0.1')
---
  def create
    @order = Order.new(params[:order])
    @order.ip_address = request.remote_ip
    @order.user_id = current_user.id
    if @order.save