app/controllers/resources_controller.rb

SELECT * FROM "resources"
---
  def index
    @resources = Resource.all

SELECT * FROM "resources" WHERE ("resources"."id" = 980190962)
---
  def show
    @resource = Resource.find(params[:id])

SELECT * FROM "resources" WHERE ("resources"."id" = 980190962)
---
  def edit
    @resource = Resource.find(params[:id])

INSERT INTO "resources" ("created_at", "port", "anchor", "updated_at", "username", "domain", "scheme", "path", "query") VALUES('2010-03-09 23:37:36', NULL, NULL, '2010-03-09 23:37:36', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save

SELECT * FROM "resources" WHERE ("resources"."id" = 980190962)
---
  def update
    @resource = Resource.find(params[:id])

SELECT * FROM "resources" WHERE ("resources"."id" = 980190962)
DELETE FROM "resources" WHERE "id" = 980190962
---
  def destroy
    @resource = Resource.find(params[:id])
    @resource.destroy