app/controllers/tips_controller.rb

SELECT * FROM "tips" WHERE ("tips"."user_id" = 1) LIMIT 1
---
  def index
    @tips = Tip.find_all_by_user_id(current_user)

SELECT * FROM "tips" WHERE ("tips"."id" = 1)
---
  def show
    @tip = Tip.find(params[:id])

SELECT * FROM "tips" WHERE ("tips"."id" = 1)
---
  def edit
    @tip = Tip.find(params[:id])

INSERT INTO "tips" ("created_at", "updated_at", "url", "amount", "user_id") VALUES('2010-03-01 23:41:44', '2010-03-01 23:41:44', 'http://communist.biz', 1.0, 123)
---
  def create
    @tip = Tip.new(params[:tip])

    @tip.user_id = current_user.id


    @tip_url = URI.split(@tip.url)
    # todo put tipped url's into the resources table
    # @resource = Resource.new
    #
    # @resource.scheme   = @tip_url.scheme
    # @resource.userinfo = @tip_url.userinfo
    # @resource.host     = @tip_url.host
    # @resource.port     = @tip_url.port
    # @resource.registry = @tip_url.registry
    # @resource.path     = @tip_url.path
    # @resource.opaque   = @tip_url.opaque
    # @resource.query    = @tip_url.query
    # @resource.fragment = @tip_url.fragment
    #
    # resource.save

    respond_to do |format|
      if @tip.save

SELECT * FROM "tips" WHERE ("tips"."id" = 980190962)
---
  def update
    @tip = Tip.find(params[:id])

SELECT * FROM "tips" WHERE ("tips"."id" = 1)
DELETE FROM "tips" WHERE "id" = 1
---
  def destroy
    @tip = Tip.find(params[:id])
    @tip.destroy