app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.roles = [Role.find_by_name("Patron")]
    if @user.save
---
SELECT * FROM "roles" WHERE ("roles"."name" = 'Patron') LIMIT 1
INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES(NULL, '2010-02-24 21:44:28', 'f60a5e298e0621ebb6000d4269b05e8a0807d55f661bbef60be2467c3f49edb9b3dda1c47780360196758532be03779f8718de7dbc9286face911a24dfed2b10', '2010-02-24 21:44:28', 0, NULL, 'E57KhPlDKN0-lu-Lwo39', NULL, '30e1bbb7d53e59c8d51d6cecb265ebcfbc77b6339923fe5422b48e14d498e9cb990d0e418386bad2e33564b3542e29b1153d9533d75c9ce1605f752b7a4d4b5d', 0, NULL, NULL, 'scott@site2.com')
UPDATE "users" SET "updated_at" = '2010-03-01 23:47:44', "last_request_at" = '2010-03-01 23:47:44' WHERE "id" = 1

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "login_count" = 7, "persistence_token" = '9ff13876e88de37f1a5d29f8628cc16381a67b54e81733ac91bdbdf92d554053d3124602dac6597646e356434fc589a8cc730196cd5497533fe2f585a1606861', "updated_at" = '2010-02-26 21:05:18', "last_request_at" = '2010-02-26 21:05:18', "last_login_at" = '2010-02-26 21:02:19', "current_login_at" = '2010-02-26 21:05:18', "password_salt" = 'GvzE461PM2eqeb-Qigln', "crypted_password" = 'f041b61efa2520c4fd1c80c1b23809ff2897a3998e95498c49282d5597dc729fc5f6a51b36eb8e47405b199b9243c2c395a0f8be70a668bb6c4456e45100d457' WHERE "id" = 8