app/controllers/user_sessions_controller.rb

UPDATE "users" SET "login_count" = 2, "failed_login_count" = 0, "updated_at" = '2010-03-11 22:42:09', "last_request_at" = '2010-03-11 22:42:09', "last_login_at" = '2010-03-11 20:58:57', "last_login_ip" = '127.0.0.1', "current_login_at" = '2010-03-11 22:42:09' WHERE "id" = 1
---
  def create
    if "yes" == params[:registered]
      @user_session = UserSession.create(params[:user])
      if @user_session.valid?
        flash[:notice] = "Successfully logged in."
        redirect_to root_url
      else
        flash[:notice] = "We didn't recognize your email or password. Please try again."
        render :action => 'new'
      end
    else
      @user = User.new(params[:user])
      @user.roles = [Role.find_by_name("Patron")]
      if @user.save